{"data":{"dataJson":{"htmlTest":"<a href=\"https://www.w3schools.com\">Visit W3Schools.com!</a>","profile":["I'm Anthony, a Software Developer born in France and living in Dublin for 4 years. I have a Higher Diploma in Computer Science in Software Development (1st Class Honours) from National College of Ireland, as well as a Master’s in Management (specialised in Digital Marketing) from DCU Business School. So in addition to my development skills, I'm also well-versed in everything related to Digital Marketing, including SEO, UX and Big Data analysis.","The MERN stack is my go-to stack for prototyping and developing. That stands for MongoDB, Express, React and Node. I also enjoy working with Java, RESTful APIs, relational databases with MySQL, Bash Scripting, Ansible, PL/SQL, Python, R and version control tool Git.","On my spare time, I enjoy creative coding with tools like Processing or p5js, and I'm currently diving into C++ to be exposed to a lower level language, and get a better understanding of computer graphics."],"skills":[{"name":"React.js","description":"Designed and developed multiple modern applications with React.js, using the latest APIs such as Hooks and Context. In-depth understanding of props, state management, lifecycle methods and advanced concepts like Higher-Order Components or Props Rendering.","icon":"react","iconColor":"#61DAFB"},{"name":"Angular","description":"Developed several CRUD apps using the Angular framework. Integrated services, authentication guards and request interceptors. Comfortable with Typescript.","icon":"angular","iconColor":"#DD0031"},{"name":"Node.js","description":"Worked on multiple applications using this stack with either React or Angular to develop the front-end, or with template engines such as Pug, Mustache or EJS. Projects include secure REST APIs for CRUD operations with both JWT and session authentication, integration of 3rd Party APIs such as Stripe for payment processing, and implementation of the WebSocket protocol to develop real-time applications.","icon":"node","iconColor":"#339933"},{"name":"Express.js","description":"Worked on multiple applications using this stack with either React or Angular to develop the front-end, or with template engines such as Pug, Mustache or EJS. Projects include secure REST APIs for CRUD operations with both JWT and session authentication, integration of 3rd Party APIs such as Stripe for payment processing, and implementation of the WebSocket protocol to develop real-time applications.","icon":"node","iconColor":"#339933"},{"name":"MongoDB","description":"Worked on multiple applications using this stack with either React or Angular to develop the front-end, or with template engines such as Pug, Mustache or EJS. Projects include secure REST APIs for CRUD operations with both JWT and session authentication, integration of 3rd Party APIs such as Stripe for payment processing, and implementation of the WebSocket protocol to develop real-time applications.","icon":"mongodb","iconColor":"#47A248"},{"name":"JavaScript","description":"Strong skills in JavaScript, both inside and outside the browser, and in asynchronous and event-driven programming. Experienced with the main ES6, ES7 & ES8 features, such as arrow functions, new loops iterators, promises, async/await constructions & destructuring patterns.","icon":"javascript","iconColor":"#F7DF1E"},{"name":"Java","description":"Worked on multiple projects using Servlets, advanced data structures, sorting and searching algorithms and RESTful APIs using JAX-RS and Hibernate for data persistence. Good fundamentals of Object-Oriented and algorithm design, problem solving & complexity analysis.","icon":"java","iconColor":"#007396"},{"name":"HTML5","description":"Great knowledge of the structure and workflow of websites and web applications. Thriving for good design, and ensuring fully responsiveness of the UI. Familiar with CSS animations, SCSS/SASS & BEM syntax.","icon":"html5","iconColor":"#E34F26"},{"name":"CSS3","description":"Great knowledge of the structure and workflow of websites and web applications. Thriving for good design, and ensuring fully responsiveness of the UI. Familiar with CSS animations, SCSS/SASS & BEM syntax.","icon":"css3","iconColor":"#1572B6"},{"name":"Python","description":"Python was the fist language I learnt when I started programming. I used it mostly for Statistical Analysis and training Machine Learning models (regression, classification, & reinforcement).","icon":"python","iconColor":"#3776AB"},{"name":"Linux OS","description":"Experience with administrating Linux servers, and writing shell scripts.","icon":"linux","iconColor":"#FCC624"},{"name":"RDBMS, SQL & PL/SQL","description":"In-depth understanding of the relational model of datasets, including Primary and Foreign keys, normalisation, stored procedure and triggers, to ensure the integrity of business data at all times. Ability to design, create and query databases using advanced SQL queries and PL/SQL scripts.","icon":"mysql","iconColor":"#4479A1"}]}}}