{"data":{"dataJson":{"htmlTest":null,"profile":["I'm Anthony, a Software Developer born in France and living in Dublin for 4 years. I have a Higher Diploma in Computer Science in Software Development (1st Class Honours) from National College of Ireland, as well as a Master’s in Management (specialised in Digital Marketing) from DCU Business School. So in addition to my development skills, I'm also well-versed in everything related to Digital Marketing, including SEO, UX and Big Data analysis.","The MERN stack is my go-to stack for prototyping and developing. That stands for MongoDB, Express, React and Node. I also enjoy working with Java, RESTful APIs, relational databases with MySQL, Bash Scripting, Ansible, PL/SQL, Python, R and version control tool Git.","On my spare time, I enjoy creative coding with tools like Processing or p5js, and I'm currently diving into C++ to be exposed to a lower level language, and get a better understanding of computer graphics."],"skills":[{"name":"React.js","description":"Designed and developed multiple modern applications with React.js, including SOCCA, and loving it! Pretty good understanding of props, state management, lifecycle methods and advanced concepts like Higher-Order Components or Props Rendering. Experienced with Hooks and Context rather than legacy lifecycle methods and Redux for global state management.","icon":"react"},{"name":"Node.js","description":"Experienced with Server Side Rendering, using template engines like Pug, Mustache or EJS, but have recently mostly designed the front-end with React, and have used Node.js with the Express web framework to create API endpoints. Some projects with Node include SOCCA, secure REST APIs for CRUD operations with both JWT and session authentication, integration of 3rd Party APIs such as Stripe for payment processing, and implementation of the WebSocket protocol to develop real-time applications.","icon":"node"},{"name":"MongoDB","description":"Used for quick prototyping or when the application doesn't strongly rely on relational data, with Mongoose, a schema-based solution for Node.js, to model application data.","icon":"mongodb"},{"name":"JavaScript","description":"Strong skills in JavaScript, both inside and outside the browser, and in asynchronous and event-driven programming. Experienced with the main ES6, ES7 & ES8 features, such as arrow functions, new loops iterators, promises, async/await constructions & destructuring patterns. Also knowledgeable in setting up and managing module bundler Webpack and Babel compiler.","icon":"javascript"},{"name":"Java","description":"Worked on multiple projects using Servlets, advanced data structures, sorting and searching algorithms and RESTful APIs using JAX-RS and Hibernate for data persistence. Good fundamentals of Object-Oriented and algorithm design, problem solving & complexity analysis.","icon":"java"},{"name":"HTML5 & CSS3","description":"Great knowledge of the structure and workflow of websites and web applications. Thriving for good design, and ensuring fully responsiveness of the UI. Familiar with CSS frameworks Bulma and Bootstrap, SCSS/SASS & BEM syntax.","icon":"htmlcss"},{"name":"Linux OS & Bash Scripting","description":"Experience with setting up and administrating Linux servers, mostly Ubuntu and Red Hat distributions, managing users, setting up basic firewall with ufw, and Nginx web server, running applications as services, setting up CRON jobs and writing shell scripts.","icon":"linux"},{"name":"Python","description":"Fist language learnt when I started programming. Used it mostly for Statistical Analysis and training Machine Learning models (regression, classification, & reinforcement). Exposed to the Django and Flask web frameworks.","icon":"python"},{"name":"Angular","description":"Exposed to Angular, having developed a few CRUD apps using the framework as part of a 10 weeks training at work. Integrated services, authentication guards and request interceptors.","icon":"angular"},{"name":"RDBMS, SQL & PL/SQL","description":"In-depth understanding of the relational model of datasets, including Primary and Foreign keys, normalisation, stored procedure and triggers, to ensure the integrity of business data at all times. Ability to design, create and query databases using advanced SQL queries and PL/SQL scripts.","icon":"mysql"}]}}}