{
  "name": "Anthony Colle",
  "position": "Full Stack Developer",
  "location": "Dublin",
  "social": {
    "email": {
      "address": "anthonycolle84@gmail.com",
      "logo": "./github.png"
    },
    "github": {
      "address": "https://github.com/acolle/",
      "logo": "./email.png"
    }
  },
  "profile": [
    "Enthusiastic and curious Software Developer with a background in Digital Marketing, including SEO, UX and Big Data analysis.",
    "I hold a Higher Diploma in Computer Science in Software Development (1st Class Honours) from National College of Ireland, as well as a Master’s in Management (specialised in Digital Marketing) from DCU Business School.",
    "The MERN stack is my go-to stack for prototyping and developing, that is, React.js, Node.js with Express.js and MongoDB.",
    "Other technologies I work with include Angular, Java, RESTful APIs, relational databases with MySQL, Bash Scripting, Ansible, PL/SQL, Python, R and version control tool Git.",
    "On my spare time, I enjoy creative coding with tools like Processing or p5js, and I'm currently diving into C++ to be exposed to a lower level language, and get a better understanding of computer graphics.",
    "Excellent communicator & collaborator, familiar with Agile methodologies, and proven record of successfully building & delivering enterprise level products & applications."
  ],
  "skills": [
    {
      "name": "React.js",
      "description": "Designed and developed multiple modern applications with React.js, using the latest APIs such as Hooks and Context. In-depth understanding of props, state management, lifecycle methods and advanced concepts like Higher-Order Components or Props Rendering."
    },
    {
      "name": "Angular",
      "description": "Developed several CRUD apps using the Angular framework. Integrated services, authentication guards and request interceptors. Comfortable with Typescript."
    },
    {
      "name": "Node.js, Express.js & MongoDB",
      "description": "Worked on multiple applications using this stack with either React or Angular to develop the front-end, or with template engines such as Pug, Mustache or EJS. Projects include secure REST APIs for CRUD operations with both JWT and session authentication, integration of 3rd Party APIs such as Stripe for payment processing, and implementation of the WebSocket protocol to develop real-time applications."
    },
    {
      "name": "JavaScript",
      "description": "Strong skills in JavaScript, both inside and outside the browser, and in asynchronous and event-driven programming. Experienced with the main ES6, ES7 & ES8 features, such as arrow functions, new loops iterators, promises, async/await constructions & destructuring patterns."
    },
    {
      "name": "Java",
      "description": "Worked on multiple projects using Servlets, advanced data structures, sorting and searching algorithms and RESTful APIs using JAX-RS and Hibernate for data persistence. Good fundamentals of Object-Oriented and algorithm design, problem solving & complexity analysis."
    },
    {
      "name": "HTML/CSS",
      "description": "Great knowledge of the structure and workflow of websites and web applications. Thriving for good design, and ensuring fully responsiveness of the UI. Familiar with CSS animations, SCSS/SASS & BEM syntax."
    },
    {
      "name": "Python",
      "description": "Python was the fist language I learnt when I started programming. I used it mostly for Statistical Analysis and training Machine Learning models (regression, classification, & reinforcement)."
    },
    {
      "name": "Linux Server Administration & Bash Scripting",
      "description": "Experience with administrating Linux servers, and writing shell scripts."
    },
    {
      "name": "RDBMS, SQL & PL/SQL",
      "description": "In-depth understanding of the relational model of datasets, including Primary and Foreign keys, normalisation, stored procedure and triggers, to ensure the integrity of business data at all times. Ability to design, create and query databases using advanced SQL queries and PL/SQL scripts."
    }
  ],
  "education": [
    {
      "degree": "Higher Diploma in Computer Sciences (Software Development)",
      "institute": "National College of Ireland (NCI)",
      "location": "Dublin, Ireland",
      "year": "2018",
      "grade": "1st Class Honours",
      "modules": [
        "Software Development (95%)",
        "Introduction to Databases (83%)",
        "Web Design (92%)",
        "Architecture, OS & Network (80%)",
        "Object-Oriented Software Engineering (78%)",
        "Data Structures & Algorithms (74%)",
        "Web Services & API Development (67%)",
        "Server Side Development (70%)",
        "Advanced Programming (84%)",
        "Project (74%)"
      ]
    },
    {
      "degree": "MSc. in Management (Digital Marketing)",
      "institute": "Dublin City University Business School (DCUBS)",
      "location": "Dublin, Ireland",
      "year": "2015/2016",
      "grade": "2nd Class Honours",
      "modules": [
        "Digital Marketing Mechanics and Authorship",
        "Digital Marketing & eBusiness Management",
        "Digital Advertising & Communications",
        "Strategic Thinking & Data Analytics",
        "Marketing Strategies & Metrics, Applied Web Design & Development"
      ]
    },
    {
      "degree": "MSc. in Management & Marketing",
      "institute": "IAE Nancy School of Management",
      "year": "2014/2015",
      "location": "Nancy, France",
      "grade": "",
      "modules": []
    },
    {
      "degree": "B.Sc. in Management, Economics and Social",
      "institute": "IAE Nancy School of Management",
      "year": "2013/2014",
      "location": "Nancy, France",
      "grade": "",
      "modules": []
    }
  ],
  "work": [
    {
      "position": "Software Engineer",
      "company": "Wipro",
      "year": "2019-Present",
      "location": "Dublin, Ireland",
      "functions": [
        "Worked with Allied Irish Banks (AIB) as an ETL developer, mapping and validating data for regulatory reports on credit institutions to be submitted to the Central Bank of Ireland (CBI) and to the European Central Bank (ECB).",
        "Designed and developed a React/Spring web application for Wipro Project Managers to monitor all ongoing projects with AIB.",
        "Currently working as a System Administrator on AIB Linux servers, deploying new applications on them, and supporting them in case of failure."
      ]
    },
    {
      "position": "Digital Marketing Research Workflow Lead",
      "company": "Accenture for Google",
      "year": "2018/19",
      "location": "Dublin, Ireland",
      "functions": [
        "Coaching and mentoring newer members of the team",
        "Ensured the team functioned optimally and produced reports of the highest possible quality",
        "Continually enhanced the client-facing aspects of the team's performance.",
        "Deepening and broadening the skills base and workflow of the team"
      ]
    },
    {
      "position": "Digital Marketing Research Consultant",
      "company": "Accenture for Google",
      "year": "2017/18",
      "location": "Dublin, Ireland",
      "functions": [
        "Pilot project to provide global market and customer intelligence support to Google teams",
        "Researched, analysed and synthetised data into actionable insights to improve Google's value proposition",
        "Optimised workflow and internal processes to scale up the programme",
        "Managed requests from clients in a timely manner, ensuring growing satisfaction and engagement"
      ]
    },
    {
      "position": "Digital Marketing Consultant",
      "company": "Rendicity for Practicum Project",
      "year": "2016",
      "location": "Dublin, Ireland",
      "functions": [
        "Management of a 6-month project for an Irish SaaS start-up in the 3D rendering industry",
        "Conducted a market research to identify and understand the company's key business challenges",
        "Designed and implemented both the inbound (email, blogging, social media, webinar) and outbound (AdWords and other Paid Advertising) marketing campaigns."
      ]
    }
  ],
  "projects": [
    {
      "name": "Chat Application",
      "description": "A chat application built on Node.js with Express and Socket.IO. Users select a username and a chat room where they can then chat with all the other users currently in it",
      "tags": ["node.js", "socket.io", "mustache"],
      "urls": [
        { "name": "github", "value": "https://github.com/acolle/node-v3-chat-app/" },
        { "name": "website", "value": "https://acolle-node-v3-chat-app.herokuapp.com/" }
      ]
    },
    {
      "name": "Expense Tracker",
      "description": "An application built with React that lets users track their expenses. Authentication is handled with Firebase, state management with Redux and testing with Enzyme",
      "tags": ["react", "firebase", "redux", "enzyme", "express"],
      "urls": [
        { "name": "github", "value": "https://github.com/acolle/react-expensify-app/" },
        { "name": "website", "value": "" }
      ]
    },
    {
      "name": "Weather Forecast",
      "description": "A Node.js application built with Express that gives weather forecast. It uses the Mapbox API to get coordinates based on location and the Darksky API to provide the actual forecast based on latitude and longitude",
      "tags": ["node.js", "express", "hbs", "3rd Party API"],
      "urls": [
        { "name": "github", "value": "https://github.com/acolle/weather-web-app/" },
        { "name": "website", "value": "https://acolle-weather-app.herokuapp.com/" }
      ]
    },
    {
      "name": "Loading Spinner",
      "description": "A simple loading spinner implemented in React. The loading spinner is displayed once the client makes a request to the server which takes 4 seconds to complete. Once completed, the spinner disappear to show the response from the server",
      "tags": ["react", "animation", "express"],
      "urls": [
        { "name": "github", "value": "https://github.com/acolle/loading-spinner-react" },
        { "name": "website", "value": "" }
      ]
    }
    ,
    {
      "name": "Virtual Rendering",
      "description": "A React implementation of Virtual Rendering to prevent slow and laggy scrolling of large lists. Virtual Rendering is implemented using react-virtualized and avatars are provided by DiceBear Avatars.",
      "tags": ["react"],
      "urls": [
        { "name": "github", "value": "https://github.com/acolle/virtual-rendering-react" },
        { "name": "website", "value": "https://virtual-rendering-react.herokuapp.com/" }
      ]
    }
  ]
}
