{
  "name": "Anthony Colle",
  "position": "Full Stack Developer",
  "location": "Dublin",
  "social": {
    "email": {
      "address": "anthonycolle84@gmail.com",
      "logo": "./github.png"
    },
    "github": {
      "address": "https://github.com/acolle/",
      "logo": "./email.png"
    }
  },
  "profile": [
    "I'm Anthony, a Software Developer born in France and living in Dublin for 4 years. I have a Higher Diploma in Computer Science in Software Development (1st Class Honours) from National College of Ireland, as well as a Master’s in Management (specialised in Digital Marketing) from DCU Business School. So in addition to my development skills, I'm also well-versed in everything related to Digital Marketing, including SEO, UX and Big Data analysis.",
    "The MERN stack is my go-to stack for prototyping and developing. That stands for MongoDB, Express, React and Node. I also enjoy working with Java, RESTful APIs, relational databases with MySQL, Bash Scripting, Ansible, PL/SQL, Python, R and version control tool Git.",
    "On my spare time, I enjoy creative coding with tools like Processing or p5js, and I'm currently diving into C++ to be exposed to a lower level language, and get a better understanding of computer graphics."
  ],
  "skills": [
    {
      "name": "React.js",
      "description": "Designed and developed multiple modern applications with React.js, including SOCCA, and loving it! Pretty good understanding of props, state management, lifecycle methods and advanced concepts like Higher-Order Components or Props Rendering. Experienced with Hooks and Context rather than legacy lifecycle methods and Redux for global state management.",
      "icon": "react"
    },
    {
      "name": "Node.js",
      "description": "Experienced with Server Side Rendering, using template engines like Pug, Mustache or EJS, but have recently mostly designed the front-end with React, and have used Node.js with the Express web framework to create API endpoints. Some projects with Node include SOCCA, secure REST APIs for CRUD operations with both JWT and session authentication, integration of 3rd Party APIs such as Stripe for payment processing, and implementation of the WebSocket protocol to develop real-time applications.",
      "icon": "node"
    },
    {
      "name": "MongoDB",
      "description": "Used for quick prototyping or when the application doesn't strongly rely on relational data, with Mongoose, a schema-based solution for Node.js, to model application data.",
      "icon": "mongodb"
    },
    {
      "name": "JavaScript",
      "description": "Strong skills in JavaScript, both inside and outside the browser, and in asynchronous and event-driven programming. Experienced with the main ES6, ES7 & ES8 features, such as arrow functions, new loops iterators, promises, async/await constructions & destructuring patterns. Also knowledgeable in setting up and managing module bundler Webpack and Babel compiler.",
      "icon": "javascript"
    },
    {
      "name": "Java",
      "description": "Worked on multiple projects using Servlets, advanced data structures, sorting and searching algorithms and RESTful APIs using JAX-RS and Hibernate for data persistence. Good fundamentals of Object-Oriented and algorithm design, problem solving & complexity analysis. Would like to learn Java Spring Boot in the near future.",
      "icon": "java"
    },
    {
      "name": "HTML5 & CSS3",
      "description": "Good knowledge of the DOM and how to manipulate it. Thriving for good design, and ensuring fully responsiveness of the UI. Familiar with CSS frameworks Bulma and Bootstrap, SCSS/SASS & BEM syntax.",
      "icon": "htmlcss"
    },
    {
      "name": "Linux OS & Bash Scripting",
      "description": "Experienced setting up and administrating Linux servers, mostly Ubuntu and Red Hat distributions, managing users, setting up basic firewall with ufw, and Nginx web server as a reverse proxy and load balancer, running applications as services, setting up CRON jobs and writing shell scripts.",
      "icon": "linux"
    },
    {
      "name": "Python",
      "description": "First language learnt when I started programming. Used mostly for Statistical Analysis and Machine Learning. Tried the Django and Flask web frameworks a few times.",
      "icon": "python"
    },
    {
      "name": "Angular",
      "description": "Exposed to Angular, having developed a few CRUD apps using the framework as part of a 10 weeks training at work. Integrated services, authentication guards and request interceptors.",
      "icon": "angular"
    },
    {
      "name": "RDBMS, SQL & PL/SQL",
      "description": "In-depth understanding of the relational model of datasets, including Primary and Foreign keys, normalisation, stored procedure and triggers, to ensure the integrity of business data at all times. Ability to design, create and query databases using advanced SQL queries and PL/SQL scripts.",
      "icon": "mysql"
    }
  ],
  "education": [
    {
      "degree": "Higher Diploma in Computer Sciences (Software Development)",
      "institute": "National College of Ireland (NCI)",
      "location": "Dublin, Ireland",
      "year": "2018",
      "grade": "1st Class Honours",
      "modules": [
        "Software Development (95%)",
        "Introduction to Databases (83%)",
        "Web Design (92%)",
        "Architecture, OS & Network (80%)",
        "Object-Oriented Software Engineering (78%)",
        "Data Structures & Algorithms (74%)",
        "Web Services & API Development (67%)",
        "Server Side Development (70%)",
        "Advanced Programming (84%)",
        "Project (74%)"
      ]
    },
    {
      "degree": "MSc. in Management (Digital Marketing)",
      "institute": "Dublin City University Business School (DCUBS)",
      "location": "Dublin, Ireland",
      "year": "2015/2016",
      "grade": "2nd Class Honours",
      "modules": [
        "Digital Marketing Mechanics and Authorship",
        "Digital Marketing & eBusiness Management",
        "Digital Advertising & Communications",
        "Strategic Thinking & Data Analytics",
        "Marketing Strategies & Metrics, Applied Web Design & Development"
      ]
    },
    {
      "degree": "MSc. in Management & Marketing",
      "institute": "IAE Nancy School of Management",
      "year": "2014/2015",
      "location": "Nancy, France",
      "grade": "",
      "modules": []
    },
    {
      "degree": "B.Sc. in Management, Economics and Social",
      "institute": "IAE Nancy School of Management",
      "year": "2013/2014",
      "location": "Nancy, France",
      "grade": "",
      "modules": []
    }
  ],
  "work": [
    {
      "position": "Software Engineer",
      "company": "Wipro",
      "year": "2019-Present",
      "location": "Dublin, Ireland",
      "functions": [
        "Worked with Allied Irish Banks (AIB) as an ETL developer, mapping and validating data for regulatory reports on credit institutions to be submitted to the Central Bank of Ireland (CBI) and to the European Central Bank (ECB).",
        "Designed and developed a React/Spring web application for Wipro Project Managers to monitor all ongoing projects with AIB.",
        "Currently working as a SysAdmin / DevOps Engineer on AIB Linux servers, deploying new applications on them, and supporting them in case of failure."
      ]
    },
    {
      "position": "Digital Marketing Research Workflow Lead",
      "company": "Accenture for Google",
      "year": "2018/19",
      "location": "Dublin, Ireland",
      "functions": [
        "Coaching and mentoring newer members of the team",
        "Ensured the team functioned optimally and produced reports of the highest possible quality",
        "Continually enhanced the client-facing aspects of the team's performance.",
        "Deepening and broadening the skills base and workflow of the team"
      ]
    },
    {
      "position": "Digital Marketing Research Consultant",
      "company": "Accenture for Google",
      "year": "2017/18",
      "location": "Dublin, Ireland",
      "functions": [
        "Pilot project to provide global market and customer intelligence support to Google teams",
        "Researched, analysed and synthetised data into actionable insights to improve Google's value proposition",
        "Optimised workflow and internal processes to scale up the programme",
        "Managed requests from clients in a timely manner, ensuring growing satisfaction and engagement"
      ]
    },
    {
      "position": "Digital Marketing Consultant",
      "company": "Rendicity for Practicum Project",
      "year": "2016",
      "location": "Dublin, Ireland",
      "functions": [
        "Management of a 6-month project for an Irish SaaS start-up in the 3D rendering industry",
        "Conducted a market research to identify and understand the company's key business challenges",
        "Designed and implemented both the inbound (email, blogging, social media, webinar) and outbound (AdWords and other Paid Advertising) marketing campaigns."
      ]
    }
  ],
  "liveProjects": [{
    "name": "SOCCA",
    "description": "A virtual café where people from all backgrounds and horizons can meet up for a few minutes to learn new things, share ideas and challenge their beliefs.",
    "tags": ["react", "node.js", "socket.io", "nongoDB", "redis"],
    "urls": [
      {
        "name": "website",
        "value": "https://socca.io/"
      }
    ]
  }],
  "sideProjects": [{
      "name": "Chat Application",
      "description": "A chat application built on Node.js with Express and Socket.IO. Users select a username and a chat room where they can then chat with all the other users currently in it",
      "tags": ["node.js", "socket.io", "mustache"],
      "urls": [{
          "name": "github",
          "value": "https://github.com/acolle/node-v3-chat-app/"
        },
        {
          "name": "website",
          "value": "https://acolle-node-v3-chat-app.herokuapp.com/"
        }
      ]
    },
    {
      "name": "Expense Tracker",
      "description": "An application built with React that lets users track their expenses. Authentication is handled with Firebase, state management with Redux and testing with Enzyme",
      "tags": ["react", "firebase", "redux", "enzyme", "express"],
      "urls": [{
          "name": "github",
          "value": "https://github.com/acolle/react-expensify-app/"
        },
        {
          "name": "website",
          "value": ""
        }
      ]
    },
    {
      "name": "User Matching System",
      "description": "A Node.js application built with Express that uses Socket.IO to match users based on the information they provide, as well as the type of match they're looking for. Front end is Vanilla JS with CSS framework Bulma",
      "tags": ["node.js", "express", "socket.io", "Vanilla JS"],
      "urls": [{
          "name": "github",
          "value": "https://github.com/acolle/matching-system-socket-io"
        },
        {
          "name": "website",
          "value": "https://acolle-matching-system.herokuapp.com/"
        }
      ]
    },
    {
      "name": "Form Validation Client Side",
      "description": "A basic implementation of form validation on the client side using the two most common types: built-in form validation using HTML5 form validation features and JavaScript validation",
      "tags": ["javascript", "html5", "form"],
      "urls": [{
          "name": "github",
          "value": "https://github.com/acolle/client-form-validation"
        },
        {
          "name": "website",
          "value": "/projects/client-form-validation"
        }
      ]
    },
    {
      "name": "Weather Forecast",
      "description": "A Node.js application built with Express that gives weather forecast. It uses the Mapbox API to get coordinates based on location and the Darksky API to provide the actual forecast based on latitude and longitude",
      "tags": ["node.js", "express", "hbs", "3rd Party API"],
      "urls": [{
          "name": "github",
          "value": "https://github.com/acolle/weather-web-app/"
        },
        {
          "name": "website",
          "value": "https://acolle-weather-app.herokuapp.com/"
        }
      ]
    },
    {
      "name": "Loading Spinner",
      "description": "A simple loading spinner implemented in React. The loading spinner is displayed once the client makes a request to the server which takes 4 seconds to complete. Once completed, the spinner disappears to show the response from the server",
      "tags": ["react", "animation", "express"],
      "urls": [{
          "name": "github",
          "value": "https://github.com/acolle/loading-spinner-react"
        },
        {
          "name": "website",
          "value": ""
        }
      ]
    },
    {
      "name": "Virtual Rendering",
      "description": "A React implementation of Virtual Rendering to prevent slow and laggy scrolling of large lists. Virtual Rendering is implemented using react-virtualized and avatars are provided by DiceBear Avatars.",
      "tags": ["react"],
      "urls": [{
          "name": "github",
          "value": "https://github.com/acolle/virtual-rendering-react"
        },
        {
          "name": "website",
          "value": ""
        }
      ]
    }
  ]
}
